*1*. データの読み込み
- 各種CSVデータを読み込んでください
- 各種データフレーム名はsales_df、member_dfとしてください

In [2]:
import pandas as pd

sales_df = pd.read_csv('Sales_Data.csv')
member_df = pd.read_csv('Member_Data.csv')

2. 取引データの上部5行を表示してください

In [3]:
sales_df.head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Amount
0,1,2024/5/1 0:00,21,25,12,3,5820
1,2,2024/5/1 2:55,107,23,17,1,640
2,3,2024/5/1 5:51,117,24,6,3,1270
3,4,2024/5/1 8:47,124,38,1,3,5980
4,5,2024/5/1 11:43,281,28,5,4,9390

3. 会員データの下部5行を表示してください

In [4]:
# LLMが回答
member_df.tail(5)

     Member_ID  Gender  Age  Days_Since_Registration
295        296    Male   41                     1513
296        297  Female   58                     1613
297        298  Female   71                     1177
298        299  Female   38                     1660
299        300  Female   50                      104

In [5]:
# 自分の回答
# member_df.head(-5)

4. 取引データの各カラムの件数や型を確認してください

In [6]:
sales_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    1000 non-null   int64
 1   Transaction_Date  1000 non-null   object
 2   Member_ID         1000 non-null   int64
 3   Product_ID        1000 non-null   int64
 4   Store_ID          1000 non-null   int64
 5   Quantity          1000 non-null   int64
 6   Amount            1000 non-null   int64
dtypes: int64(6), object(1)
memory usage: 54.8+ KB

5. 取引データの各種IDのカラムを質的変数に型変換してください。会員データに関しても同様に各種IDを質的変数に型変換してください

In [7]:
member_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Member_ID                300 non-null    int64
 1   Gender                   300 non-null    object
 2   Age                      300 non-null    int64
 3   Days_Since_Registration  300 non-null    int64
dtypes: int64(3), object(1)
memory usage: 9.5+ KB

In [8]:
# LLMが回答
# Convert ID columns in sales_df to categorical type
sales_df['Transaction_ID'] = sales_df['Transaction_ID'].astype('category')
sales_df['Member_ID'] = sales_df['Member_ID'].astype('category')
sales_df['Product_ID'] = sales_df['Product_ID'].astype('category')
sales_df['Store_ID'] = sales_df['Store_ID'].astype('category')

# Convert ID columns in member_df to categorical type
member_df['Member_ID'] = member_df['Member_ID'].astype('category')

In [9]:
sales_df.info(), member_df.info() # Check if the conversion was successful

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    1000 non-null   category
 1   Transaction_Date  1000 non-null   object
 2   Member_ID         1000 non-null   category
 3   Product_ID        1000 non-null   category
 4   Store_ID          1000 non-null   category
 5   Quantity          1000 non-null   int64
 6   Amount            1000 non-null   int64
dtypes: category(4), int64(2), object(1)
memory usage: 83.0+ KB
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Member_ID                300 non-null    category
 1   Gender                   300 non-null    object
 2   Age                      300 non-null    int64
 3   Days_Since_Registration  300 non-null    int64
dtypes: category(1), int64(2), object(1)
memory usage: 18.2+ KB

(None, None)

In [10]:
# member_df['Days_Since_Registration']

6. 日付データをdatetime型に変換してください

In [11]:
sales_df['Transaction_Date'] = pd.to_datetime(sales_df['Transaction_Date'])

7. 取引データの各列の基本的な統計情報（平均、標準偏差など）を表示してください

In [12]:
sales_df.describe()

                    Transaction_Date     Quantity        Amount
count                           1000  1000.000000   1000.000000
mean   2024-06-30 23:59:30.299999744     2.551000   5338.650000
min              2024-05-01 00:00:00     1.000000    510.000000
25%              2024-05-31 11:59:15     2.000000   3022.500000
50%              2024-06-30 23:59:30     3.000000   5250.000000
75%              2024-07-31 11:59:45     4.000000   7752.500000
max              2024-08-31 00:00:00     4.000000  10000.000000
std                              NaN     1.103003   2778.234487

8. カラム名の変更
- データフレームのAmountのカラム名をSales_Amountに変更してください
- データフレームは上書きしないでください

In [13]:
# LLMが回答
sales_df_llm_work = sales_df.rename(columns={'Amount': 'Sales_Amount'})

In [14]:
# 自分で調べた方法
sales_df_my_work = sales_df.copy()
# sales_df['Amount']
sales_df_my_work.columns = ['Transaction_ID', 'Transaction_Date', 'Member_ID', 'Product_ID',
       'Store_ID', 'Quantity', 'Sales_Amount']
sales_df_my_work.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Transaction_ID    1000 non-null   category
 1   Transaction_Date  1000 non-null   datetime64[ns]
 2   Member_ID         1000 non-null   category
 3   Product_ID        1000 non-null   category
 4   Store_ID          1000 non-null   category
 5   Quantity          1000 non-null   int64
 6   Sales_Amount      1000 non-null   int64
dtypes: category(4), datetime64[ns](1), int64(2)
memory usage: 83.0 KB

In [15]:
# 二つのやり方を比較
sales_df_llm_work.head()
# print("="*20)
sales_df_my_work.head()

# 両方同じ結果が出たので、どちらでも良い

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5820
1,2,2024-05-01 02:55:00,107,23,17,1,640
2,3,2024-05-01 05:51:00,117,24,6,3,1270
3,4,2024-05-01 08:47:00,124,38,1,3,5980
4,5,2024-05-01 11:43:00,281,28,5,4,9390

9. Amountを100円単位に四捨五入して表示してください

In [16]:
# 自分で調べた方法
sales_df_my_work['Sales_Amount'] = sales_df_my_work['Sales_Amount'].round(-2) # Round to the nearest 100
sales_df_my_work.head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400

In [17]:
# LLMが回答(同じ結果になった)
sales_df_llm_work['Sales_Amount'] = sales_df_llm_work['Sales_Amount'].round(-2)  # Round to the nearest 100
sales_df_llm_work.head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400

10. 取引データからAmountが5000円を超える取引を抽出してください

In [18]:
sales_df_my_work[sales_df_my_work['Sales_Amount'] < 5000].head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
11,12,2024-05-02 08:14:00,275,9,19,4,3700
14,15,2024-05-02 17:01:00,27,44,15,1,3300
16,17,2024-05-02 22:53:00,239,32,4,3,2700

11. 会員データから30歳から50歳の会員を抽出してください

In [19]:
# 自分の回答
# member_df[30 <= member_df['Age'] <= 50].head() # この書き方はエラーになる。条件式は分ける必要がある。

# 自分で調べた方法
# filtered_df = member_df.query('30 <= Age <= 50')
# print(filtered_df) # 同じ結果になる
filtered_df = member_df.loc[(member_df['Age'] >= 30) & (member_df['Age'] <= 50)]
print(filtered_df)

    Member_ID  Gender  Age  Days_Since_Registration
3           4  Female   49                     1881
8           9    Male   48                     1640
9          10  Female   48                     1317
12         13    Male   41                     1855
13         14    Male   33                      928
..        ...     ...  ...                      ...
292       293  Female   35                      388
293       294    Male   32                     1127
295       296    Male   41                     1513
298       299  Female   38                     1660
299       300  Female   50                      104

[114 rows x 4 columns]

In [20]:
# LLMが回答
member_df[(member_df['Age'] >= 30) & (member_df['Age'] <= 50)]

    Member_ID  Gender  Age  Days_Since_Registration
3           4  Female   49                     1881
8           9    Male   48                     1640
9          10  Female   48                     1317
12         13    Male   41                     1855
13         14    Male   33                      928
..        ...     ...  ...                      ...
292       293  Female   35                      388
293       294    Male   32                     1127
295       296    Male   41                     1513
298       299  Female   38                     1660
299       300  Female   50                      104

[114 rows x 4 columns]

12. 取引データから"2024-08-01"以降に行われた取引を抽出してください

In [21]:
# 自分の回答
sales_df_my_work[sales_df_my_work['Transaction_Date'] > '2024-08-01']

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
754,755,2024-08-01 01:55:00,226,17,14,4,8600
755,756,2024-08-01 04:51:00,131,18,18,3,1000
756,757,2024-08-01 07:47:00,76,45,13,3,1900
757,758,2024-08-01 10:42:00,286,29,11,1,4400
758,759,2024-08-01 13:38:00,277,20,16,1,5100
...,...,...,...,...,...,...,...
995,996,2024-08-30 12:16:00,213,33,15,3,8400
996,997,2024-08-30 15:12:00,62,49,19,3,3900
997,998,2024-08-30 18:08:00,49,12,11,4,2500
998,999,2024-08-30 21:04:00,127,11,15,3,4200
999,1000,2024-08-31 00:00:00,223,5,12,2,7500

In [22]:
# LLMの回答
sales_df_llm_work[sales_df_llm_work['Transaction_Date'] >= '2024-08-01'] # >=以外は自分の回答と同じ

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
754,755,2024-08-01 01:55:00,226,17,14,4,8600
755,756,2024-08-01 04:51:00,131,18,18,3,1000
756,757,2024-08-01 07:47:00,76,45,13,3,1900
757,758,2024-08-01 10:42:00,286,29,11,1,4400
758,759,2024-08-01 13:38:00,277,20,16,1,5100
...,...,...,...,...,...,...,...
995,996,2024-08-30 12:16:00,213,33,15,3,8400
996,997,2024-08-30 15:12:00,62,49,19,3,3900
997,998,2024-08-30 18:08:00,49,12,11,4,2500
998,999,2024-08-30 21:04:00,127,11,15,3,4200
999,1000,2024-08-31 00:00:00,223,5,12,2,7500

13. Store_ID が「1」または「3」で、かつ Amount が5000円以上の取引を抽出してください

In [23]:
# sales_df_my_work['Store_ID'].nunique()
sales_df_my_work[(sales_df_my_work['Store_ID'] == 1) | (sales_df_my_work['Store_ID'] == 3) & (sales_df_my_work['Sales_Amount'] >= 5000)]

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
3,4,2024-05-01 08:47:00,124,38,1,3,6000
7,8,2024-05-01 20:30:00,51,18,1,4,5500
17,18,2024-05-03 01:49:00,156,3,1,3,7600
61,62,2024-05-08 10:47:00,50,38,3,4,6500
65,66,2024-05-08 22:30:00,60,49,3,2,5800
...,...,...,...,...,...,...,...
942,943,2024-08-24 00:56:00,1,4,1,2,3800
946,947,2024-08-24 12:39:00,72,43,1,2,7600
947,948,2024-08-24 15:35:00,109,35,1,1,9100
953,954,2024-08-25 09:10:00,8,4,3,2,7300
968,969,2024-08-27 05:08:00,225,13,3,2,6800

14. Product_ID が「10」、「20」、「30」のいずれかに一致する取引を抽出してください

In [24]:
# 自分の回答
# sales_df_my_work[sales_df_my_work['Product_ID'] in ['10', '20', '30']] # この書き方はエラーになる。inの使い方が間違っている。

# 自分で調べた方法
sales_df_my_work[sales_df_my_work['Product_ID'].isin([10, 20, 30])].head()
# sales_df_my_work.query("Product_ID in [10, 20, 30]").head() # 上記と同じ結果になる

# '10'ではなく、10という部分も間違っていたので、修正

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
13,14,2024-05-02 14:06:00,52,30,2,1,8600
41,42,2024-05-06 00:10:00,47,20,12,1,3100
44,45,2024-05-06 08:57:00,277,10,10,4,6900
69,70,2024-05-09 10:14:00,164,30,9,3,4600
84,85,2024-05-11 06:11:00,138,30,2,3,1800

In [25]:
# LLMの回答
sales_df_llm_work[sales_df_llm_work['Product_ID'].isin([10, 20, 30])].head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
13,14,2024-05-02 14:06:00,52,30,2,1,8600
41,42,2024-05-06 00:10:00,47,20,12,1,3100
44,45,2024-05-06 08:57:00,277,10,10,4,6900
69,70,2024-05-09 10:14:00,164,30,9,3,4600
84,85,2024-05-11 06:11:00,138,30,2,3,1800

In [26]:
# type(sales_df_my_work['Product_ID'][0])
# sales_df_my_work.info()
# sales_df_my_work['Product_ID'] = sales_df_my_work['Product_ID'].astype(int)

# sales_df_my_work['Product_ID'].dtype # categories_dtype=int64
# sales_df_my_work['Quantity'].dtype # dtype('int64')

15. Product_ID が「10」、「20」、「30」ではない取引を抽出してください

In [27]:
# 自分で調べた方法
sales_df_my_work[~sales_df_my_work['Product_ID'].isin([10, 20, 30])].head()
# sales_df_my_work.query("Product_ID not in [10, 20, 30]").head() # 上記と同じ結果になる

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
1,2,2024-05-01 02:55:00,107,23,17,1,600
2,3,2024-05-01 05:51:00,117,24,6,3,1300
3,4,2024-05-01 08:47:00,124,38,1,3,6000
4,5,2024-05-01 11:43:00,281,28,5,4,9400

16. Quantity が最頻値で、かつ Store_ID が「3」の取引を抽出してください

In [28]:
# 自分で調べた方法
# sales_df_my_work['Quantity'].nunique()
# sales_df_my_work['Quantity'].value_counts()
# sales_df_my_work['Quantity'].mode()[0] # 4が最も多い

# [0]とiloc[0]は同じだが可読性向上する

# Quantityの最頻値を求める
mode_quantity = sales_df_my_work['Quantity'].mode().iloc[0]
# 条件に合うデータを抽出
filtered_df = sales_df_my_work[(sales_df_my_work['Quantity'] == mode_quantity) & (sales_df_my_work['Store_ID'] == 3)]
# 結果を表示
print(filtered_df)

    Transaction_ID    Transaction_Date Member_ID Product_ID Store_ID  \
43              44 2024-05-06 06:01:00       118         29        3
61              62 2024-05-08 10:47:00        50         38        3
109            110 2024-05-14 07:28:00       229         49        3
383            384 2024-06-16 18:32:00       269         44        3
446            447 2024-06-24 11:11:00       108         13        3
472            473 2024-06-27 15:23:00        14         44        3
491            492 2024-06-29 23:05:00       202         38        3
710            711 2024-07-26 16:57:00       114         36        3
808            809 2024-08-07 16:11:00        46         48        3
908            909 2024-08-19 21:17:00        93          2        3

     Quantity  Sales_Amount
43          4          4800
61          4          6500
109         4          9800
383         4          4300
446         4          7800
472         4          3500
491         4          8000
710         4          9700
808         4          5100
908         4          2100

In [29]:
# LLMの回答
# Calculate the mode of the Quantity column
quantity_mode = sales_df_llm_work['Quantity'].mode()[0]

# Filter transactions where Quantity is the mode and Store_ID is 3
filtered_transactions = sales_df_llm_work[(sales_df_my_work['Quantity'] == quantity_mode) & (sales_df_llm_work['Store_ID'] == 3)]
print(filtered_transactions)

    Transaction_ID    Transaction_Date Member_ID Product_ID Store_ID  \
43              44 2024-05-06 06:01:00       118         29        3
61              62 2024-05-08 10:47:00        50         38        3
109            110 2024-05-14 07:28:00       229         49        3
383            384 2024-06-16 18:32:00       269         44        3
446            447 2024-06-24 11:11:00       108         13        3
472            473 2024-06-27 15:23:00        14         44        3
491            492 2024-06-29 23:05:00       202         38        3
710            711 2024-07-26 16:57:00       114         36        3
808            809 2024-08-07 16:11:00        46         48        3
908            909 2024-08-19 21:17:00        93          2        3

     Quantity  Sales_Amount
43          4          4800
61          4          6500
109         4          9800
383         4          4300
446         4          7800
472         4          3500
491         4          8000
710         4          9700
808         4          5100
908         4          2100

17. Amount が第1四分位から第3四分位の範囲に属する取引を抽出してください

In [30]:
# 自分で調べた方法
# sales_df_my_work['Sales_Amount'].describe()
q1 = sales_df_my_work['Sales_Amount'].quantile(0.25)
q3 = sales_df_my_work['Sales_Amount'].quantile(0.75)

sales_df_my_work[(sales_df_my_work['Sales_Amount'] >= q1) & (sales_df_my_work['Sales_Amount'] <= q3)].head()

,Transaction_ID,Transaction_Date,Member_ID,Product_ID,Store_ID,Quantity,Sales_Amount
0,1,2024-05-01 00:00:00,21,25,12,3,5800
3,4,2024-05-01 08:47:00,124,38,1,3,6000
7,8,2024-05-01 20:30:00,51,18,1,4,5500
10,11,2024-05-02 05:18:00,141,45,9,4,6700
11,12,2024-05-02 08:14:00,275,9,19,4,3700

18. Product_IDとStore_IDは何種類あるか確認してください

In [31]:
sales_df_my_work['Product_ID'].nunique(), sales_df_my_work['Store_ID'].nunique()

(50, 20)

19. 取引データのProduct_ID ごとに Amount の合計を計算してください

In [32]:
sales_df_my_work.groupby('Product_ID')['Sales_Amount'].sum() # LLMで修正
# sales_df_my_work.groupby('Product_ID')['Sales_Amount'].sum().nunique()
# sales_df_my_work.groupby('Product_ID')['Sales_Amount'].nunique()

# メモ
# グループ化: df.groupby('column_name')は、指定された列('column_name')の値に基づいてデータをグループ化します。
# 集計: その後、集計関数（例：sum(), mean(), count()など）を適用して、各グループごとに計算を行います。
# 例：result = df.groupby('category')['value'].sum()
# 'category'列の値でデータをグループ化
# 各グループ内の'value'列の合計を計算

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/956988122.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_df_my_work.groupby('Product_ID')['Sales_Amount'].sum() # LLMで修正

Product_ID
1     121600
2      49800
3     110300
4     122600
5      76700
6      84700
7      94200
8     135900
9      72600
10     92100
11    138700
12     63900
13    139300
14     70300
15     68100
16    106200
17    169400
18    109900
19    130500
20     83700
21    111700
22    128400
23    106500
24    114100
25     88800
26    101600
27    102600
28    121200
29    126000
30     85300
31    106100
32    124900
33     58300
34    126300
35    123200
36    172300
37    126400
38    130800
39     77300
40    110600
41    110600
42     77400
43    101800
44     97100
45    148600
46     55500
47    156200
48     78100
49    118700
50    111200
Name: Sales_Amount, dtype: int64

20. Product_ID ごとにQuantityの中央値を計算してください

In [33]:
sales_df_my_work.groupby('Product_ID')['Quantity'].median()

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/293935698.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_df_my_work.groupby('Product_ID')['Quantity'].median()

Product_ID
1     2.0
2     2.0
3     3.0
4     2.0
5     3.0
6     3.0
7     2.0
8     2.0
9     3.0
10    3.0
11    3.0
12    3.0
13    2.0
14    3.0
15    2.5
16    3.0
17    2.0
18    3.0
19    2.0
20    3.0
21    2.5
22    3.0
23    2.0
24    2.0
25    3.0
26    2.0
27    2.0
28    3.0
29    3.0
30    3.0
31    3.0
32    3.0
33    3.0
34    3.0
35    3.0
36    3.0
37    3.0
38    3.0
39    3.0
40    2.0
41    2.0
42    3.0
43    2.0
44    2.5
45    3.0
46    2.0
47    2.0
48    2.5
49    3.0
50    2.0
Name: Quantity, dtype: float64

In [34]:
# LLMが回答
sales_df_llm_work.groupby('Product_ID')['Quantity'].median()

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/682049455.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_df_llm_work.groupby('Product_ID')['Quantity'].median()

Product_ID
1     2.0
2     2.0
3     3.0
4     2.0
5     3.0
6     3.0
7     2.0
8     2.0
9     3.0
10    3.0
11    3.0
12    3.0
13    2.0
14    3.0
15    2.5
16    3.0
17    2.0
18    3.0
19    2.0
20    3.0
21    2.5
22    3.0
23    2.0
24    2.0
25    3.0
26    2.0
27    2.0
28    3.0
29    3.0
30    3.0
31    3.0
32    3.0
33    3.0
34    3.0
35    3.0
36    3.0
37    3.0
38    3.0
39    3.0
40    2.0
41    2.0
42    3.0
43    2.0
44    2.5
45    3.0
46    2.0
47    2.0
48    2.5
49    3.0
50    2.0
Name: Quantity, dtype: float64

21. Store_ID ごとに平均Amountを集計してください

In [46]:
sales_df_my_work.groupby('Store_ID')['Sales_Amount'].mean()

# sales_df_my_work.groupby('Store_ID')：データフレームをStore_IDでグループ化します。
# ['Amount'].mean()：各グループ（つまり各Store_ID）のAmount列の平均値を計算します。
# 結果はstore_avg_amountというSeriesに格納されます。
# このSeriesのインデックスはStore_IDで、値はそれぞれのStore_IDに対応するAmountの平均になります。

# 結果をより見やすくする
# store_avg_amount_df = sales_df_my_work.groupby('Store_ID')['Sales_Amount'].mean().reset_index()
# store_avg_amount_df.columns = ['Store_ID', 'Average_Amount']
# print(store_avg_amount_df)

/var/folders/7h/pvrr2skj31l3k_w_t4bj4q280000gn/T/ipykernel_79774/2556034677.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  sales_df_my_work.groupby('Store_ID')['Sales_Amount'].mean()

Store_ID
1     5873.333333
2     4630.952381
3     5507.843137
4     5329.268293
5     5686.363636
6     5361.111111
7     5458.974359
8     5436.065574
9     5619.047619
10    5301.923077
11    4868.000000
12    5602.272727
13    5815.254237
14    5873.333333
15    5585.937500
16    5201.960784
17    4727.536232
18    4885.416667
19    5091.489362
20    5075.000000
Name: Sales_Amount, dtype: float64

22. 会員データの性別 (Gender) ごとに平均年齢を計算してください

In [47]:
member_df.groupby('Gender')['Age'].mean()

Gender
Female    48.945205
Male      53.259740
Name: Age, dtype: float64

23. 会員ごとに平均 Amount を計算してください

In [54]:
# member_df.groupby('Member_ID')['Amount'].mean()
# member_df.info()
# member_df.columns
sales_df_my_work.columns

Index(['Transaction_ID', 'Transaction_Date', 'Member_ID', 'Product_ID',
       'Store_ID', 'Quantity', 'Sales_Amount'],
      dtype='object')

24. Transaction_Dateから日付だけ取り出して日付ごとに Amount の合計を集計してください

25. 日付ごとの合計Amountを集計し、合計Amountが小さい順にソートしてください

26. 月ごとに Amount を集計してください

27. 月ごとのAmountの増減の絶対値を前月と比較して計算してください

28. 曜日ごとの合計Amountを集計してください

29. 1週間ごとに合計Amountを集計してください

30. 1週間ごとのAmountの増減を計算し、増加率をパーセンテージで表示してください

31. 新しく作成したカラムを削除してください

32. Amount が1000円を超える取引を抽出し、Store_ID と Product_ID ごとに Amount の合計を計算してください

33. Store_ID ごとの合計Amountを集計し300000円以上の店舗を抽出してください

34. 会員ごとに取引回数をカウントしてください

35. 会員ごとに取引回数をカウントし、2回以上の取引がある会員を抽出してください

36. 年齢グループ（-30歳、31-50歳、51-65歳、66歳-）を作成し、各グループの会員数を集計してください。

37. 会員になってからの日数（Days_Since_Registration）のグループ（〜1年、1年〜2年, 2年〜）を作成し、各グループの会員数を集計してください

38. 売上データと会員データを結合しmerged_dfとして定義してください

39. 性別 ごとに 平均Amount を計算してください

40. 性別ごとの平均 Quantity を集計してください

41. 性別と店舗IDごとに取引数を集計してください

42. Store_ID が [1, 5, 9] の取引を抽出し、Store_ID ごとに Quantity の合計を計算してください

43. データセットの最後の10日間の取引を抽出し、Transaction_Date ごとにAmountを集計してください

44. 合計Amountが最も高い会員トップ5を特定してください

45. 会員ごとに最も新しい取引を集計してください

46. 会員ごとに最も古い取引を集計してください

47. 会員ごとに取引日時の最も古いデータと最も新しいデータを集計し、それぞれが違うレコードを抽出してください

48. Member_ID に「2」が含まれる会員の取引を抽出してください。

49. Product_ID が「1」で始まる取引を抽出してください。

50. Store_ID が「5」で終わる取引を抽出してください

51. Transaction_ID が奇数の取引を抽出してください

52. Member_ID が3桁の会員の取引を抽出してください

53. Member_ID に「1」と「3」が連続して含まれる取引を抽出してください

54. Member_ID が「1」で始まり、任意の数字が続く会員の取引を抽出してください

55. Product_IDごとの Quantityの最頻値を集計し、最頻値が3以上の商品を抽出してください

56. Product_IDごとのQuantityの最頻値を計算し、最頻値が最大の商品を抽出してください

57. Store_ID ごとにAmountの分散を計算し、分散が大きい順にソートしてください

58. Member_ID ごとにAmountの標準偏差を計算し、標準偏差が4000以上の会員を抽出してください

59. 会員データにおいて年齢ごとに会員数を集計し、会員数が多い順にソートしてください

60. 会員データの年齢の中央値を計算し、それより上の会員を抽出してください

61. Amountの大きいものから順番にランクを付与した上で昇順で並び替えてください。また同じAmountの場合は先に出現したものに高いランクを付与してください。

62. Member_ID ごとの合計Amountに対して、パーセンタイル値を計算して低い順に並び替えてください

63. 年代を縦（行）、性別を横（列）に持つテーブルで、各セグメントごとの平均取引金額を集計してください

64. 前の課題のテーブルを、年代と性別が縦に並ぶように変換してください

65. 年代✕性別のごとの取引回数を集計し表示してください

66. Amount が2000円以上なら 1、それ未満なら 0 を割り振ったフラグを新しいカラムに追加してください

67. Quantity の平均値以上の取引に 1、それ未満に 0 のフラグを追加してください

68. 顧客ごとの合計Amountに基づいて、〜25%点、〜50%点、〜75%点、〜100%点ごとに4つのカテゴリに分け、そのカテゴリを新しいカラムとして追加してください

69. Quantityが小さい順に等しく3つのカテゴリに分け、そのカテゴリを新しいカラムに追加してください

70. Gender カラムをダミー変数化してください

71. Amount カラムを標準化して新しいカラムを追加してください

72. 取引データ全体のうち10%をランダムにサンプリングしてください

73. 会員データの20%をランダムにサンプリングしてください

74. Amount が5000円以上の取引からランダムに5件をサンプリングしてください

75. Gender を層化基準にして取引データから20%抽出してください

76. Amount の平均から1σ以上離れた取引を外れ値として抽出してください（本来は3σ）

77. 現在のmember_dfをCSVファイルとして出力をしてください

78. seaborn を使って、merged_dfの数値カラム間の相関行列をヒートマップで可視化してください

79. plotlyを使って、merged_dfの数値カラム間の相関行列をヒートマップで可視化してください

80. matplotlib を使って、月ごとの合計Amountを棒グラフで表示してください

81. seaborn を使って、Store_ID ごとの取引数をカウントプロットで可視化してください

82. seaborn を使って、Store_ID ごとの合計Amountを棒グラフで表示してください

83. Plotlyを使って会員ごとの取引数を可視化してください

84. matplotlib を使って、日ごとの売上金額を折れ線グラフで表示してください

85. seaborn を使って、Amount の分布を箱ひげ図で表示してください

86. Days_Since_Registration に基づく顧客の分布を plotly の箱ひげ図で可視化してください

87. matplotlib を使って、Amount と Days_Since_Registration の関係を散布図で表示してください

88. plotly を使って、Days_Since_Registration と Amount の関係を散布図で表示してください。Store_IDごとに色を変えてください

89. seaborn の pairplot を使って、merged_dataの数値カラムの相関をペアプロットで可視化してください

90. plotly を使って、Product_ID ごとの売上と販売数量をバブルチャートで表示してください。Product_IDがX軸でAmountがY軸、そしてQuantityがバブルの大きさになるようにしてください

91. Amount カラムの分布をカーネル密度推定プロットで可視化してください

92. seaborn の regplot を使って、Amount と Days_Since_Registration の散布図に回帰直線を追加して可視化してください

93. seaborn の jointplot を使って、Amount と Days_Since_Registration の相関をヒストグラムと散布図を組み合わせた形で可視化してください

94. seaborn の violinplot を使って、Store_IDが1,3,5 の Quantity の分布を Violinプロットで可視化してください

95. matplotlib を使って、店舗ごとの売上合計をエリアチャートで可視化してください

96. matplotlib を使って、Store_ID ごとの売上を円グラフ（パイチャート）で可視化してください

97. Store_ID ごとの売上合計を plotly の円グラフ（パイチャート）で可視化してください

98. 取引日 ごとの売上累積を plotly のエリアチャートで可視化してください

99. Amount の分布を plotly のヒストグラムで可視化してください

100. Age と Days_Since_Registration の関係を散布図で可視化し、色分けを性別（Gender）に基づいて行ってください